# 设置工作路径
setwd("D:\\softwares\\applied statistics\\rcodelearning\\chap6\\sourcecode")
# 距离判别函数
discriminiant_distance <- function(TrnX1, TrnX2, TstX = NULL, var_equal = FALSE) {
    # TrnX1是训练样本，类别1
    # TrnX2是训练样本，类别2
    # TstX是测试样本
    # 判断，若没有训练样本，那么训练样本就是原训练集
    if (is.null(TstX) == TRUE) {
        TstX <- rbind(TrnX1, TrnX2)
    }
    # 判断TstX是否是向量
    if (is.vector(TstX) == TRUE) {
        # 若是，则转为矩阵
        TstX <- t(as.matrix(TstX))
    } else if (is.matrix(TstX) != TRUE) { # 判断是否矩阵
        # 若不是，则强制转换为矩阵
        TstX <- as.matrix(TstX)
    }
    # 判断TrnX1是否为矩阵，否，则强制转换
    if (is.matrix(TrnX1) != TRUE) {
        TrnX1 <- as.matrix(TrnX1)
    }
    # 判断TrnX2是否为矩阵，否，则强制转换
    if (is.matrix(TrnX2) != TRUE) {
        TrnX2 <- as.matrix(TrnX2)
    }
    # 提取训练集的行数
    nx <- nrow(TstX)
    # 定义所属类别矩阵
    blong <- matrix(rep(0, nx),
        nrow = 1, byrow = TRUE,
        dimnames = list("blong", 1:nx)
    )
    # 计算训练样本类别1的列均值
    mu1 <- colMeans(TrnX1)
    # 计算训练样本类别2的列均值
    mu2 <- colMeans(TrnX2)
    # 若两个训练样本是来自同方差的总体
    if (var_equal == TRUE || var_equal == T) {
        # 计算样本方差
        S_square <- var(rbind(TrnX1, TrnX2))
        # 计算距离差
        w <- mahalanobis(TstX, mu2, S_square) -
            mahalanobis(TstX, mu1, S_square)
    } else {
        # 计算样本方差
        S_square1 <- var(TrnX1)
        # 计算样本方差
        S_square2 <- var(TrnX2)
        # 计算距离差
        w <- mahalanobis(TstX, mu2, S_square2) -
            mahalanobis(TstX, mu1, S_square1)
    }
    for (i in 1:nx) {
        if (w[i] > 0) {
            blong[i] <- 1
        } else {
            blong[i] <- 2
        }
    }
    return(blong)
}

classX1 <- data.frame(
    x1 = c(
        6.60, 6.60, 6.10, 6.10, 8.40, 7.2, 8.40, 7.50,
        7.50, 8.30, 7.80, 7.80
    ),
    x2 = c(
        39.00, 39.00, 47.00, 47.00, 32.00, 6.0, 113.00, 52.00,
        52.00, 113.00, 172.00, 172.00
    ),
    x3 = c(
        1.00, 1.00, 1.00, 1.00, 2.00, 1.0, 3.50, 1.00,
        3.50, 0.00, 1.00, 1.50
    ),
    x4 = c(
        6.00, 6.00, 6.00, 6.00, 7.50, 7.0, 6.00, 6.00,
        7.50, 7.50, 3.50, 3.00
    ),
    x5 = c(
        6.00, 12.00, 6.00, 12.00, 19.00, 28.0, 18.00, 12.00,
        6.00, 35.00, 14.00, 15.00
    ),
    x6 = c(
        0.12, 0.12, 0.08, 0.08, 0.35, 0.3, 0.15, 0.16, 0.16,
        0.12, 0.21, 0.21
    ),
    x7 = c(
        20.00, 20.00, 12.00, 12.00, 75.00, 30.0, 75.00, 40.00,
        40.00, 180.00, 45.00, 45.00
    )
)
classX2 <- data.frame(
    x1 = c(
        8.40, 8.40, 8.40, 6.3, 7.00, 7.00, 7.00, 8.30,
        8.30, 7.2, 7.2, 7.2, 5.50, 8.40, 8.40, 7.50,
        7.50, 8.30, 8.30, 8.30, 8.30, 7.80, 7.80
    ),
    x2 = c(
        32.0, 32.00, 32.00, 11.0, 8.00, 8.00, 8.00, 161.00,
        161.0, 6.0, 6.0, 6.0, 6.00, 113.00, 113.00, 52.00,
        52.00, 97.00, 97.00, 89.00, 56.00, 172.00, 283.00
    ),
    x3 = c(
        1.00, 2.00, 2.50, 4.5, 4.50, 6.00, 1.50, 1.50,
        0.50, 3.5, 1.0, 1.0, 2.50, 3.50, 3.50, 1.00,
        1.00, 0.00, 2.50, 0.00, 1.50, 1.00, 1.00
    ),
    x4 = c(
        5.00, 9.00, 4.00, 7.5, 4.50, 7.50, 6.00, 4.00,
        2.50, 4.0, 3.0, 6.0, 3.00, 4.50, 4.50, 6.00,
        7.50, 6.00, 6.00, 6.00, 6.00, 3.50, 4.50
    ),
    x5 = c(
        4.00, 10.00, 10.00, 3.0, 9.00, 4.00, 1.00, 4.00,
        1.00, 12.0, 3.0, 5.0, 7.00, 6.00, 8.00, 6.00,
        8.00, 5.00, 5.00, 10.00, 13.00, 6.00, 6.00
    ),
    x6 = c(
        0.35, 0.35, 0.35, 0.2, 0.25, 0.25, 0.25, 0.08,
        0.08, 0.30, 0.3, 0.3, 0.18, 0.15, 0.15, 0.16,
        0.16, 0.15, 0.15, 0.16, 0.25, 0.21, 0.18
    ),
    x7 = c(
        75.00, 75.00, 75.00, 15.0, 30.00, 30.00, 30.00, 70.00,
        70.00, 30.0, 30.0, 30.0, 18.00, 75.00, 75.00, 40.00,
        40.00, 180.00, 180.00, 180.00, 180.00, 45.00, 45.00
    )
)
res1 <- discriminiant_distance(classX1, classX2, var_equal = TRUE)
res2 <- discriminiant_distance(classX1, classX2)
print(res1)
print(res2)
# 保存工作空间
save.image("R1.RData")
